src/cf/Documents/эв_СтавкиБонусовПервостольника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>эв_СтавкиБонусовПервостольника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.эв_СтавкиБонусовПервостольника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтавкиБонусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/эв_СтавкиБонусовПервостольника/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОтбора = РежимОтбораВсе();
	ЗаполнитьТаблицуСтруктурныхЕдиниц();
	
	Если Объект.ВерсияДанных = "" Тогда
		Объект.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктурныеЕдиницы

&НаКлиенте
Процедура СтруктурныеЕдиницыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		СтруктурнаяЕдиницаДоИзменения = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
	Иначе
		СтруктурнаяЕдиницаДоИзменения = ТекущиеДанные.СтруктурнаяЕдиница;
	КонецЕсли;
	
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурныеЕдиницыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("СтруктурнаяЕдиница", ТекущиеДанные.СтруктурнаяЕдиница);
	СтрокиСтавок = Объект.СтавкиБонусов.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаСтавки Из СтрокиСтавок Цикл
		Объект.СтавкиБонусов.Удалить(СтрокаСтавки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурныеЕдиницыСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначение = ТекущиеДанные.СтруктурнаяЕдиница;
	
	Если НовоеЗначение = СтруктурнаяЕдиницаДоИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовоеЗначение) Тогда
		ПараметрыПоиска = Новый Структура("СтруктурнаяЕдиница", НовоеЗначение);
		НайденныеСтроки = СтруктурныеЕдиницы.НайтиСтроки(ПараметрыПоиска);
		Если НайденныеСтроки.Количество() > 1 Тогда
			ТекущиеДанные.СтруктурнаяЕдиница = СтруктурнаяЕдиницаДоИзменения;
			ПоказатьПредупреждение(, НСтр("ru = 'Структурная единица уже добавлена.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаДоИзменения) Тогда
		ПараметрыПоиска = Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиницаДоИзменения);
		СтрокиСтавок = Объект.СтавкиБонусов.НайтиСтроки(ПараметрыПоиска);
		Для Каждого СтрокаСтавки Из СтрокиСтавок Цикл
			СтрокаСтавки.СтруктурнаяЕдиница = НовоеЗначение;
			УстановитьПризнакНовый(СтрокаСтавки);
		КонецЦикла;
	КонецЕсли;
	
	СтруктурнаяЕдиницаДоИзменения = НовоеЗначение;
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурныеЕдиницыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ОтменаРедактирования = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтавкиБонусов

&НаКлиенте
Процедура СтавкиБонусовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не СтруктурнаяЕдиницаГлавнойТаблицыЗаполнена() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиБонусовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СтавкиБонусов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ОтменаРедактирования = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиБонусовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СтавкиБонусов.ТекущиеДанные;
	ТекущиеДанныеГлавной = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	
	Если ТекущиеДанныеГлавной <> Неопределено Тогда
		ТекущиеДанные.СтруктурнаяЕдиница = ТекущиеДанныеГлавной.СтруктурнаяЕдиница;
	КонецЕсли;
	
	Если Не Копирование Тогда
		ТекущиеДанные.Автор = ПользователиКлиент.ТекущийПользователь();
	КонецЕсли;
	
	УстановитьПризнакНовый(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиБонусовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПризнакНовый(Элементы.СтавкиБонусов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиБонусовНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтавкиБонусов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоНоменклатуре(ТекущиеДанные);
	УстановитьПризнакНовый(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьБонусыКлиент()
	
	ПараметрыОтбора = ПараметрыОтбораСтавокБонусов();
	СтрокиДляЗаполнения = Объект.СтавкиБонусов.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаСтавки Из СтрокиДляЗаполнения Цикл
		СтрокаСтавки.ПроцентИБ = ИБ;
		СтрокаСтавки.ПроцентКБ = КБ;
		СтрокаСтавки.СуммаИБ = ИБФС;
		СтрокаСтавки.СуммаКБ = КБФС;
		СтрокаСтавки.ДатаОкончания = Объект.ДатаОкончания;
		УстановитьПризнакНовый(СтрокаСтавки);
	КонецЦикла;
	
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСОтбором(Команда)
	
	Если Не СтруктурнаяЕдиницаГлавнойТаблицыЗаполнена() Тогда
        Возврат;  
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДопОтборНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Будут добавлены товары по доп. отбору. Продолжжить?";
		 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  

КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьДопОтборНаКлиенте(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;
	
	ТекущиеДанныеГлавной = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	
	Если ТекущиеДанныеГлавной <> Неопределено Тогда
		
		ПараметрыОтбора = Новый Структура("Период, Магазин, УникальныйИдентификатор", КонецДня(Объект.Дата), ТекущиеДанныеГлавной.СтруктурнаяЕдиница, УникальныйИдентификатор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьОтборОкончание", ЭтотОбъект, ПараметрыОтбора);
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("Документ.эв_СтавкиБонусовПервостольника.Форма.ФормаОтбора", ПараметрыОтбора, Новый УникальныйИдентификатор,,,, ОписаниеОповещения, Режим); 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереПоДопОтбору(АдресТаблицыРезультата)
	
	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресТаблицыРезультата);
	
	Попытка
		Объект.СтавкиБонусов.Загрузить(ТаблицаРезультата);
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтборОкончание(Результат, ДопПараметры) Экспорт
	
	Если Результат.Свойство("АдресТаблицыРезультата") И ЗначениеЗаполнено(Результат.АдресТаблицыРезультата) Тогда

		ЗаполнитьНаСервереПоДопОтбору(Результат.АдресТаблицыРезультата); 
		
	//	УстановитьСтатусФормы(Ложь);

	Иначе
		Возврат;    
	КонецЕсли;  


КонецПроцедуры

&НаСервере
Функция НоменклатураПараметрыНаСервере(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ор_Производитель КАК Производитель,
		|	Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Номенклатура.Родитель КАК Специализация
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураПараметров = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи   
		СтруктураПараметров.Вставить("Производитель", ВыборкаДетальныеЗаписи.Производитель);
		СтруктураПараметров.Вставить("ЦеноваяГруппа", ВыборкаДетальныеЗаписи.ЦеноваяГруппа);
		СтруктураПараметров.Вставить("Специализация", ВыборкаДетальныеЗаписи.Специализация);
	КонецЦикла;
	
	Возврат СтруктураПараметров;	

	
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗадатьДатуОкончания();
КонецПроцедуры

&НаСервере
Процедура ЗадатьДатуОкончания()

	ДатаОкончания = КонецМесяца(Объект.Дата);

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИзФайлаНаСервере(Адрес, Расширение)
	
	НЕСписокНоменклатуры = Новый СписокЗначений;

	НовоеИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(НовоеИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(НовоеИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	МассивАртикулов    = Новый Массив;
	МассивШК           = Новый Массив;
	МассивНаименований = Новый Массив;

	Для Каждого ОбластьТД ИЗ ТабличныйДокумент.Области Цикл
		
		ИмяЛиста     = ОбластьТД.Имя;
		ОбластьФайла = ТабличныйДокумент.ПолучитьОбласть(ИмяЛиста);
		
		КолВоСтрокФайла   = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
		
		Для нСтрокаТФ = 2 ПО КолВоСтрокФайла Цикл
			нСтрока = СтрЗаменить(нСтрокаТФ, Символы.НПП, "");
			
			НаименованиеТовара = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+1).ТекущаяОбласть.Текст;
			АртикулТовара      = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+2).ТекущаяОбласть.Текст;
			ШтрихкодТовара     = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+3).ТекущаяОбласть.Текст;
			
			НС = Объект.СтавкиБонусов.Добавить();
			
			НС.Наименование = НаименованиеТовара;
			НС.Артикул      = АртикулТовара;
			НС.ШК           = ШтрихкодТовара;
			Если ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+4).ТекущаяОбласть.Текст = "" Тогда
				НС.ПроцентИБНовый = 0;
			ИНаче	
				НС.ПроцентИБНовый = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+4).ТекущаяОбласть.Значение;
			КонецЕсли;
			Если ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+5).ТекущаяОбласть.Текст = "" Тогда
				НС.ПроцентКБНовый = 0;
			ИНаче	
				НС.ПроцентКБНовый = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+5).ТекущаяОбласть.Значение;
			КонецЕсли;
			Если ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+6).ТекущаяОбласть.Текст = "" Тогда
				НС.СуммаИБНовый = 0;
			ИНаче	
				НС.СуммаИБНовый = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+6).ТекущаяОбласть.Значение;
			КонецЕсли;
			Если ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+7).ТекущаяОбласть.Текст = "" Тогда
				НС.СуммаКБНовый = 0;
			ИНаче	
				НС.СуммаКБНовый = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+7).ТекущаяОбласть.Значение;
			КонецЕсли;
			
			НС.ДатаОкончанияНовый = Объект.ДатаОкончания;
			
			Если МассивАртикулов.Найти(АртикулТовара) = Неопределено Тогда
			    МассивАртикулов.Добавить(АртикулТовара);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Артикул КАК Артикул,
		|	Товары.Ссылка КАК Товар
		|ИЗ
		|	Справочник.Номенклатура КАК Товары
		|ГДЕ
		|	Товары.Артикул В(&Артикулы)";
	
	Запрос.УстановитьПараметр("Артикулы", МассивАртикулов);
	
	РезультатЗапросаАртикулы = Запрос.Выполнить().Выгрузить();
	
	Отбор = новый Структура("Артикул");
	Для каждого Стр Из Объект.СтавкиБонусов Цикл
	   Отбор.Артикул = Стр.Артикул;
	   
	   МС = РезультатЗапросаАртикулы.НайтиСтроки(Отбор);
	   Если МС.Количество() = 0 Тогда
		   Если ЗначениеЗаполнено(Стр.ШК) И МассивШК.Найти(Стр.ШК) = Неопределено Тогда
	       	МассивШК.Добавить(Стр.ШК);  	
		   КонецЕсли;
	   ИНаче
		   Стр.Номенклатура = МС[0].Товар;
	   КонецЕсли;	
	
	КонецЦикла;
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.Номенклатура) КАК Товар,
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод В(&Штрихкоды)";
	
	Запрос.УстановитьПараметр("Штрихкоды", МассивШК);
	
	ТЗ_ШК = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура("Штрихкод");
	Для каждого Стр Из Объект.СтавкиБонусов Цикл
	   Отбор.Штрихкод = Стр.ШК;
	   
	   МС = ТЗ_ШК.НайтиСтроки(Отбор);
	   Если МС.Количество() = 0 Тогда
           Стр.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Стр.Наименование,Истина);
	   ИНаче
		   Стр.Номенклатура = МС[0].Товар;
	   КонецЕсли;	
	   
	   Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
		   СтрМассив = Новый Массив;
		   СтрМассив.Добавить(Стр.Артикул);
		   СтрМассив.Добавить(Стр.ШК);
		   СтрМассив.Добавить(Стр.Наименование);
		   
		   НЕСписокНоменклатуры.Добавить(СтрСоединить(СтрМассив," "));
	   Иначе
		   
 			Стр.Производитель = Стр.Номенклатура.ор_Производитель;  
			Стр.Специализация = Стр.Номенклатура.родитель;
			Стр.ЦеноваяГруппа = Стр.Номенклатура.ЦеноваяГруппа;
			Стр.ПризнакОтбора = "Новый";

	   КонецЕсли;
	КонецЦикла;


	Если НЕСписокНоменклатуры.Количество() > 0 Тогда
		 
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена номенклатура:"); 
		 НеНайдено = 0;
		 Для Каждого НетНоменклатуры Из НЕСписокНоменклатуры Цикл
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1", НетНоменклатуры));
			 НеНайдено = НеНайдено + 1;
		 КонецЦикла;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найдено %1 позиций ЛС. Отредактируйте список бонусной номенклатуры вручную!", НеНайдено));
		 
	 КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершениеУБ(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = ОписаниеПомещенногоФайла.Адрес;
	Расширение = Сред(ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение, 2);
	
	ЗаполнитьИзФайлаНаСервере(АдресФайла, Расширение);
	
	//УстановитьСтатусФормы(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайлаНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершениеУБ", ЭтаФорма, Неопределено);

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл загрузки'; en = 'Select file'");
	Фильтр = НСтр("ru = 'xls'; en = 'xls'") + " (*.xls)|*.xls|" + 
			 НСтр("ru = 'xlsx'; en = 'xlsx'") + " (*.xlsx)|*.xlsx|";
	
   	ПараметрыДиалога.Фильтр = Фильтр;
	
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	Если Не СтруктурнаяЕдиницаГлавнойТаблицыЗаполнена() Тогда
		Отказ = Истина;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзФайлаНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Будут добавлены товары из файла. Продолжжить?";
		 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьБонусыНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;

	ЗаполнитьБонусыКлиент();
	//УстановитьСтатусФормы(Ложь);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗадатьБонусы(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗадатьБонусыНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Будут перезаполнены проценты и суммы. Продолжжить?";
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроизводителейНаСервере(Магазин)
	
	 Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");	
	 
	 СписокНоменклатуры   = Новый СписокЗначений;
	 НЕСписокНоменклатуры = Новый СписокЗначений;
	 
	 Для Стр = 1 По Макет.ВысотаТаблицы Цикл
		 
		 Ячейка = Макет.Область(Стр, 1);
		 ЗначениеВЯчейке = Ячейка.Текст;
		 Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ЗначениеВЯчейке, Истина);
		 Если НЕ Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда  
			 Если НЕ СписокНоменклатуры.НайтиПоЗначению(Номенклатура) = Неопределено Тогда
				 Продолжить;
			 КонецЕсли;
			 СписокНоменклатуры.Добавить(Номенклатура);
		 Иначе
			 НЕСписокНоменклатуры.Добавить(ЗначениеВЯчейке);
		 КонецЕсли;
		 
	 КонецЦикла; 
	 
	 Если НЕСписокНоменклатуры.Количество() > 0 Тогда
		 
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена номенклатура:"); 
		 НеНайдено = 0;
		 Для Каждого НетНоменклатуры Из НЕСписокНоменклатуры Цикл
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1", НетНоменклатуры));
			 НеНайдено = НеНайдено + 1;
		 КонецЦикла;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найдено %1 позиций ЛС. Отредактируйте список бонусной номенклатуры вручную!", НеНайдено));
		 
	 КонецЕсли; 
	 
	 Если СписокНоменклатуры.Количество() > 0 Тогда
	 	ЗаполнитьНаСервере("Номенклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНоменклатуры, Магазин);
	 КонецЕсли;
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроизводителейНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;
	
	ТекущиеДанныеГлавной = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	
    ЗаполнитьПроизводителейНаСервере(ТекущиеДанныеГлавной.СтруктурнаяЕдиница);  
	
//	УстановитьСтатусФормы(Ложь);

КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПроизводителей(Команда)
	
	Если Не СтруктурнаяЕдиницаГлавнойТаблицыЗаполнена() Тогда
		Отказ = Истина;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПроизводителейНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Будут добавлены товары производителей. Продолжжить?";
		 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СтруктурнаяЕдиницаГлавнойТаблицыЗаполнена()
	
	ТекущиеДанныеГлавной = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	
	Если ТекущиеДанныеГлавной = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанныеГлавной.СтруктурнаяЕдиница) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите Аптеку в таблице слева!");
		Возврат Ложь;
	ИНаче
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСтруктурныхЕдиниц()
	
	СтруктурныеЕдиницы.Очистить();
	
	УникальныеЗначения = Новый Массив;
	
	Если Объект.ВерсияДанных = "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СинхронизацияДанныхЧерезУниверсальныйФорматСклады.Склад КАК Склад
		|ИЗ
		|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Склады КАК СинхронизацияДанныхЧерезУниверсальныйФорматСклады";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			УникальныеЗначения.Добавить(ВыборкаДетальныеЗаписи.Склад);
		КонецЦикла;
		
	Иначе	
		
		Для Каждого СтрокаСтавки Из Объект.СтавкиБонусов Цикл
			
			Если НЕ УникальныеЗначения.Найти(СтрокаСтавки.СтруктурнаяЕдиница) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УникальныеЗначения.Добавить(СтрокаСтавки.СтруктурнаяЕдиница);
			
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Склад Из УникальныеЗначения Цикл
		НоваяСтрока = СтруктурныеЕдиницы.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = Склад;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоНоменклатуре(ТекущиеДанные)
	
	ДанныеНоменклатуры = ДанныеНоменклатуры(ТекущиеДанные.Номенклатура);
	ТекущиеДанные.ЦеноваяГруппа = ДанныеНоменклатуры.ЦеноваяГруппа;
	ТекущиеДанные.Производитель = ДанныеНоменклатуры.Производитель;
	ТекущиеДанные.Специализация = ДанныеНоменклатуры.Специализация;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеНоменклатуры(Номенклатура)
	
	Результат = Новый Структура;
	Результат.Вставить("ЦеноваяГруппа", Справочники.ЦеновыеГруппы.ПустаяСсылка());
	Результат.Вставить("Производитель", Справочники.Контрагенты.ПустаяСсылка());
	Результат.Вставить("Специализация", Справочники.Номенклатура.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Номенклатура,
		"ЦеноваяГруппа, Производитель, Родитель");
	
	Результат.ЦеноваяГруппа = ЗначенияРеквизитов.ЦеноваяГруппа;
	Результат.Производитель = ЗначенияРеквизитов.Производитель;
	Результат.Специализация = ЗначенияРеквизитов.Родитель;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПризнакНовый(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПризнакОтбора = ПризнакОтбораНовый();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтавокБонусов()
	
	Элементы.СтавкиБонусов.ОтборСтрок = Новый ФиксированнаяСтруктура(ПараметрыОтбораСтавокБонусов());
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОтбораСтавокБонусов()
	
	ПараметрыОтбора = Новый Структура;
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыОтбора.Вставить("СтруктурнаяЕдиница",
			ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка"));
	Иначе
		ПараметрыОтбора.Вставить("СтруктурнаяЕдиница", ТекущиеДанные.СтруктурнаяЕдиница);
	КонецЕсли;
	
	Если ТолькоИзмененные = РежимОтбораНовый() Тогда
		ПараметрыОтбора.Вставить("ПризнакОтбора", ПризнакОтбораНовый());
	ИначеЕсли ТолькоИзмененные = РежимОтбораИзменен() Тогда
		ПараметрыОтбора.Вставить("ПризнакОтбора", ПризнакОтбораИзменен());
	КонецЕсли;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПризнакОтбораНовый()
	
	Возврат "Новый";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПризнакОтбораИзменен()
	
	Возврат "Изменен";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимОтбораВсе()
	
	Возврат 1;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимОтбораНовый()
	
	Возврат 2;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимОтбораИзменен()
	
	Возврат 3;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
	    Возврат;
	КонецЕсли;
	
	ПризнакИзменен = ПризнакОтбораИзменен();
	ПризнакНовый = ПризнакОтбораНовый();
	
	Для Каждого СтрокаСтавки Из Объект.СтавкиБонусов Цикл
		Если СтрокаСтавки.ПризнакОтбора = ПризнакНовый Тогда
			СтрокаСтавки.ПризнакОтбора = ПризнакИзменен;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОтборСтавокБонусов();
	
КонецПроцедуры

&НаСервере   
Процедура УстановитьПараметр(НастройкиКомпоновки, Рекв, Значение)

	ПараметрКомпоновки   = Новый ПараметрКомпоновкиДанных(Рекв);
	ПараметрСКД          = НастройкиКомпоновки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Если ПараметрСКД = Неопределено Тогда
	   Возврат;
	КонецЕсли;
	ПараметрСКД.Значение = Значение;
	ПараметрСКД.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементОтбора(Родитель, ИмяОтбора, ВидСравненияКомпоновки, Значение)
	
	ЭлементОтбора = Родитель.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновки;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Значение;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ИмяОтбора, ВидСравненияКомпоновки, Значение, Магазин)
	// Вставить содержимое обработчика.
	
	СхемаКомпоновки     = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СКД");   
	НастройкиКомпоновки = ОтборКомпоновщикНастроек.ПолучитьНастройки(); 
	
	УстановитьПараметр(НастройкиКомпоновки, "СтруктурныеЕдиницы", Магазин);
	УстановитьПараметр(НастройкиКомпоновки, "Период",           КонецДня(Объект.Дата));
	
	ДобавитьЭлементОтбора(НастройкиКомпоновки.Отбор.Элементы, ИмяОтбора, ВидСравненияКомпоновки, Значение);

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки1 	= КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки1);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТабЗнач = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТабЗнач);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ПроцессорВывода.ЗакончитьВывод(); 
	
	Объект.СтавкиБонусов.Загрузить(ТабЗнач);
	
КонецПроцедуры


#КонецОбласти
